In [2]:
import pandas as pd
df= pd.read_csv("emp.csv")

In [3]:
df

   eno   ename  salary  deptno         doj
0   10   Amber    1000      10  2018-05-14
1    2    Amar    1000      10  2017-03-22
2    8   Sagar    1000      20  2020-11-30
3    4  Thomas    1000      10  2019-08-18
4    5    Jade    2000      10  2021-02-10
5    6   Smith    1000      10  2016-12-01
6    7  Robert    3000      20  2023-06-25
7    3    Nick    1000      30  2015-09-15
8    9   Naman    4000      30  2020-01-20

In [5]:
df['eno']

0    10
1     2
2     8
3     4
4     5
5     6
6     7
7     3
8     9
Name: eno, dtype: int64

In [7]:
df_eno_ename_sal= df[['eno','ename','salary']]

In [9]:
type(df_eno_ename_sal)

pandas.core.frame.DataFrame

In [12]:
df.iloc[0:5]

   eno   ename  salary  deptno         doj
0   10   Amber    1000      10  2018-05-14
1    2    Amar    1000      10  2017-03-22
2    8   Sagar    1000      20  2020-11-30
3    4  Thomas    1000      10  2019-08-18
4    5    Jade    2000      10  2021-02-10